Revit 2026 API

# NumberingSchemaMergeSequences Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void MergeSequences(
	IList<string> sourcePartitions,
	string newPartition
)
```
```vb
Public Sub MergeSequences (
	sourcePartitions As IList(Of String),
	newPartition As String
)
```
```cpp
public:
void MergeSequences(
	IList<String^>^ sourcePartitions,
	String^ newPartition
)
```
```fsharp
member MergeSequences :
        sourcePartitions : IList<string> *
        newPartition : string -> unit
```

#### Parameters

sourcePartitions IListString

newPartition String

#### Reference

NumberingSchema Class

Autodesk.Revit.DB Namespace